console.log("It was a mistake.");
/* 
 Number - числовой тип данных
 2 
 -678
 6.98
 Оперторы для нумбер 
 Бинарные  операторы:
 +  - сложение
 -  - вычитание
 *  - умножение
 /  - деление
 () - группировка
 %  - остаток от деления
 ** - возведение в степень

 Унарные операторы:
 + - положительное число
 - -  отрицательное число

 String - строковый тип данных:
 "строка епта"   
 "" - пустая строка
 " "- строка с пробелом
 'ебааа еще строка'
 `волшебная строчка только для js и только сегодня`

*/

console.log( 8 ** (1/3) );
2 + 2 + 2;
4 + 2;

let name;  // var | let
let word = "help";  // объявление переменной и задание значения в одном выражении

name = "peepee poopoo";  // завершенное действие - инструкция, она кончается точкой с запятой
word = "Cheems";

console.log("This is " + word + "'s" + name);

console.log(`this is ${word}-'s ${name}`);

/* Boolean - логический тип данных: true -1, false - 0
Операторы сравнения 
>  - больше
>= - больше иль равно
< - меньше
<= - меньше иль равно
== - сравненеие на равенство
!= - сравнение на неравенство
=== - строгое сравнение (сначала чек тип данных а затем значение)
!== - строгое неравенство 
*/

console.log("22" === 22);

